Documents/ДвижениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ДвижениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Биржа</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.Подотчет</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.ПартииВалюты</xr:Item>
				<xr:Item>AccumulationRegister.Инвестиции</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязаноИнвойсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенег</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДКурс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДОбратный</Name>
					<Comment>Обратный расчет (от конечной суммы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентИнвестиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьСреднийКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>сумма в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Comment>Сумма оплаты (в валюте текущего документа)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПересчитыватьПриходТовара</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПартииВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииВалюты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазовойВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Долги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>Долги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДолгПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаПоставщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Чем</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Деньги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>Деньги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДоходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ДоходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДвижениеДенег/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = глПрефиксДефис(Фирма, ДСчет);
КонецПроцедуры

Процедура ПересчитатьИтоги()
	Строк = Привязки.Количество();
	СуммаПривязано = Привязки.Итог("Сумма1");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// © Primus1C  02.04.2025  НАЧАЛО ►
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;      
	
	// 0. Время
	
	Если ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.ОбменВалюты Тогда
		Если СубДВалюта.ВестиПартионныйУчет Тогда
			// покупка партионной валюты
			лВремя = 1;
		Иначе
			лВремя = 0;
		КонецЕсли;	
	Иначе
		лВремя = 0;
	КонецЕсли;
	Дата = КонецДня(Дата) - лВремя;
	
	// 1. Проверка остатка для партионной валюты
	
	Если ПриходРасход = Перечисления.ПриходРасход.Расход И Валюта.ВестиПартионныйУчет Тогда
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		             |	ПартииВалютыОстатки.СуммаОстаток КАК Сумма
		             |ИЗ
		             |	РегистрНакопления.ПартииВалюты.Остатки(
		             |			&Дата,
		             |			Касса = &Касса
		             |				И Валюта = &Валюта) КАК ПартииВалютыОстатки";
		Запр.УстановитьПараметр("Дата", Дата);
		Запр.УстановитьПараметр("Касса", ДСчет);
		Запр.УстановитьПараметр("Валюта", Валюта);
		Выборка = Запр.Выполнить().Выбрать();
	    Выборка.Следующий();
		Если Выборка.Сумма < Сумма Тогда
			Сообщить(СтрШаблон("Недостаточно денег для списания: остаток %1, требуется %2", Формат(Выборка.Сумма, "ЧДЦ=2"), Формат(Сумма, "ЧДЦ=2"))); 
			Отказ = Истина; 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// 2.1. Собираем инвойсы из ТЕКУЩЕЙ (новой или измененной) табличной части
	МассивИнвойсов = ЭтотОбъект.Инвойсы.Выгрузить(,"Инвойс").ВыгрузитьКолонку(0);
	
	// 2.2. Если документ не новый, вытаскиваем СТАРЫЕ инвойсы прямо из БД
	Если Не ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТЧИнвойсы.Инвойс КАК Инвойс
			|ИЗ
			|	Документ.ДвижениеДенег.Инвойсы КАК ТЧИнвойсы
			|ГДЕ
			|	ТЧИнвойсы.Ссылка = &Ссылка
			|	И ТЧИнвойсы.Инвойс <> ЗНАЧЕНИЕ(Документ._Инвойс.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если МассивИнвойсов.Найти(Выборка.Инвойс) = Неопределено Тогда
				МассивИнвойсов.Добавить(Выборка.Инвойс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 2.3. Сохраняем объединенный массив в кэш объекта (он доживет до проведения)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ИнвойсыДляЗаписиСтатусов", МассивИнвойсов);
	
	// © Primus1C  ОКОНЧАНИЕ ◄

	//Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Фирма) Тогда Фирма = гоФирма() КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	//Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДатаСеанса() КонецЕсли; 
	//КемСохранен = гоПользователь();
	//Сохранен = ТекущаяДатаСеанса();
	глЗаписатьОбщиеРеквизиты(ЭтотОбъект);

	Если НЕ ЗначениеЗаполнено(ПриходРасход) Тогда ПриходРасход = Перечисления.ПриходРасход.Приход КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВидДвиженияДенег) Тогда ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Покупатели КонецЕсли;
	
	Если ВидДвиженияДенег <> Перечисления.ВидДвиженияДенег.Логистика И ВидДвиженияДенег <> Перечисления.ВидДвиженияДенег.Поставщики Тогда  
    	Инвойсы.Очистить();
	КонецЕсли;	
		
	//2015.11.26
	//изначально суммы КР у нас нет
	СуммаКР = 0;
	
	Если ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Покупатели Тогда
		ПриходРасход = Перечисления.ПриходРасход.Приход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда Сообщить("Не заполнен покупатель!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли; 
		Корреспонденция = "покуп: " + Контрагент;
		
		//2015.11.26
		//можно ли полностью копировать схему из поставщика по КР?
		//надо пробовать
		//не годится, нужно МЕНЯТЬ ЗНАК
		Для Каждого Стр Из Привязки Цикл
			//2015.11.26
			правильнаяСумма = омСервер.ПересчетЗн(Стр.Сумма2, Стр.Валюта2, Валюта, Фирма, Дата, 2);
			//вот тут отнимаем наоборот
			Если правильнаяСумма <> Стр.Сумма1 Тогда гоПлюс(СуммаКР, Стр.Сумма1 - правильнаяСумма) КонецЕсли;
		КонецЦикла; 
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Поставщики Тогда  
		ПриходРасход = Перечисления.ПриходРасход.Расход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда Сообщить("Не заполнен поставщик!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли; 
		Корреспонденция = "пост: " + Контрагент;
		
		//2015.11.26
		//здесь тоже возникают КР, но только в привязках
		Для Каждого Стр Из Привязки Цикл
			//2015.11.26
			//мы закрываем долг поставщику в какой-то валюте, по какому-то курсу
			//значит, можем пересчитать его обратно по текущему курсу
			//разница накапливается
			//а вот имеет ли значение, закрываем мы предоплату или нет?
			//надо попробовать
			//пусть в прошлом месяце мы сделали предоплату в долларах 100 долларов
			//прошло время, он нам их возвращает рублями по 65, хотя сейчас курс 64 - возникает положительная разница
			правильнаяСумма = омСервер.ПересчетЗн(Стр.Сумма2, Стр.Валюта2, Валюта, Фирма, Дата, 2);
			Если правильнаяСумма <> Стр.Сумма1 Тогда гоПлюс(СуммаКР, правильнаяСумма - Стр.Сумма1) КонецЕсли; 
		КонецЦикла; 
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Перемещение Тогда  
		ПриходРасход = Перечисления.ПриходРасход.Расход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(СубДСчет) Тогда Сообщить("Не заполнена касса КУДА!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли; 
		Корреспонденция = "в: " + СубДСчет;
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.ОбменВалюты Тогда 
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		ПриходРасход = Перечисления.ПриходРасход.Расход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(СубДСчет) Тогда Сообщить("Не заполнена касса КУДА!"); Отказ = Истина; Возврат; КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СубДВалюта) Тогда Сообщить("Не заполнено В КАКУЮ валюту!"); Отказ = Истина; Возврат; КонецЕсли;
			Если СубДСумма = 0 Тогда Сообщить("Не посчитана сумма обмена!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли;
		Корреспонденция = "обмен в " + СубДВалюта + " в: " + СубДСчет;
		
		// © Primus1C  24.05.2025  НАЧАЛО ►
		
		// закомментировал 
		
		////2015.11.26
		////вот первый вариант, когда может возникнуть КР
		////нужно посчитать, какая бы сумма обмена была бы, если бы курс был текущий?
		//правильнаяСумма = омСервер.ПересчетЗн(СубДСумма, СубДВалюта, Валюта, Фирма, Дата, 2);
		//Если правильнаяСумма <> Сумма Тогда
		//	//но эта разница получается в валюте обмена!!!
		//	//правильно ли это?
		//	//нужно что-то другое
		//	//надо думать
		//	//мы купили 100 долларов за 6500 рублей, а курс 64, т.е. мы потеряли 100 рублей
		//	//нужно наоборот, посчитать, за сколько мы могли бы купить, если бы по правильному курсу
		//	//вот теперь это в валюте документа и составляет 100 рублей, выведем ее на экран
		//	
		//	СуммаКР = правильнаяСумма - Сумма;
		//	
		//КонецЕсли;       
		
		Документы.ДвижениеДенег.УстановитьКурсовуюРазницу(ЭтотОбъект, Истина);
		
		// © Primus1C  ОКОНЧАНИЕ ◄
		
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Расходы Тогда  
		ПриходРасход = Перечисления.ПриходРасход.Расход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(Статья) Тогда Сообщить("Не заполнена статья расходов!"); Отказ = Истина; Возврат; КонецЕсли;
			Если Статья.ВидСтатьи <> Перечисления.ДоходРасход.Расход Тогда Сообщить("Это не статья расходов!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли; 
		Корреспонденция = "расх: " + Статья;
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Доходы Тогда  
		ПриходРасход = Перечисления.ПриходРасход.Приход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(Статья) Тогда Сообщить("Не заполнена статья доходов!"); Отказ = Истина; Возврат; КонецЕсли;
			Если Статья.ВидСтатьи <> Перечисления.ДоходРасход.Доход Тогда Сообщить("Это не статья доходов!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли; 
		Корреспонденция = "дох: " + Статья;
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Подотчет Тогда  
		ПриходРасход = Перечисления.ПриходРасход.Расход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда Сообщить("Не заполнен сотрудник (подотчетное лицо)!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли; 
		Корреспонденция = "подотч: " + Сотрудник;
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Зарплата Тогда  
		ПриходРасход = Перечисления.ПриходРасход.Расход;
		Если Окончательно Тогда  
			Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда Сообщить("Не заполнен сотрудник!"); Отказ = Истина; Возврат; КонецЕсли;
			Если НЕ ЗначениеЗаполнено(МесяцЗП) Тогда Сообщить("Не заполнен месяц начисления зарплаты!"); Отказ = Истина; Возврат; КонецЕсли;
		КонецЕсли; 
		Корреспонденция = "зарпл: " + Сотрудник + "/" + Формат(МесяцЗП, "ДФ=MM.yyyy");
	//2016.01.31	
	ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.ВводОстатков Тогда  
		ПриходРасход = Перечисления.ПриходРасход.Приход;
		Если Окончательно Тогда  
			//а что тут проверять
		КонецЕсли; 
		Корреспонденция = "ввод остатков";    
	КонецЕсли; 
	
	// Средний курс Начало
	
	Если ВидДвиженияДенег <> Перечисления.ВидДвиженияДенег.ОбменВалюты Тогда
		РассчитыватьСреднийКурс = Ложь;
	КонецЕсли;
	
	БылПроведенРасчетСрКурса = Ложь;
	МассивПересчетаСрКурсов = Новый Массив;
	
	// Узнаем состояние документа в базе данных ДО текущих изменений пользователя
	Если Не ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ВалютаДоллар", ПараметрыСеанса.БазоваяВалюта);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Док.Проведен
			|		И Док.ВидДвиженияДенег = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДенег.ОбменВалюты)
			|		И Док.РассчитыватьСреднийКурс
			|		И (Док.Валюта = &ВалютаДоллар
			|			ИЛИ Док.СубДВалюта = &ВалютаДоллар) КАК БылПроведенРасчетСрКурса,
			|	ВЫБОР
			|		КОГДА Док.Валюта = &ВалютаДоллар
			|			ТОГДА Док.СубДВалюта
			|		ИНАЧЕ Док.Валюта
			|	КОНЕЦ КАК ВалютаОбмена,
			|	ВЫБОР
			|		КОГДА Док.Валюта = &ВалютаДоллар
			|			ТОГДА ""Покупка""
			|		ИНАЧЕ ""Продажа""
			|	КОНЕЦ КАК ПокупкаПродажа,
			|	Док.Дата КАК Дата
			|ИЗ
			|	Документ.ДвижениеДенег КАК Док
			|ГДЕ
			|	Док.Ссылка = &Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			БылПроведенРасчетСрКурса = Выборка.БылПроведенРасчетСрКурса;
			Если БылПроведенРасчетСрКурса Тогда
				МассивПересчетаСрКурсов.Добавить(Новый Структура("Валюта,Дата,ПокупкаПродажа", Выборка.ВалютаОбмена, НачалоДня(Выборка.Дата), Выборка.ПокупкаПродажа));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Состояние документа "в памяти" (то, что пользователь пытается записать) 
	Если ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.ОбменВалюты И РассчитыватьСреднийКурс Тогда
		Если Валюта = ПараметрыСеанса.БазоваяВалюта Тогда
			лВалютаОбмена = СубДВалюта;  
			лПокупкаПродажа = "Покупка";
		Иначе
			лВалютаОбмена = Валюта;
			лПокупкаПродажа = "Продажа";
		КонецЕсли;
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			МассивПересчетаСрКурсов.Добавить(Новый Структура("Валюта,Дата,ПокупкаПродажа", лВалютаОбмена, НачалоДня(Дата), лПокупкаПродажа));
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			// При отмене проведения пересчет нужен, только если мы отменяем именно "Обмен"
			Если БылПроведенРасчетСрКурса Тогда
				МассивПересчетаСрКурсов.Добавить(Новый Структура("Валюта,Дата,ПокупкаПродажа", лВалютаОбмена, НачалоДня(Дата), лПокупкаПродажа));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Прячем в дополнительные свойства объекта
	Если МассивПересчетаСрКурсов.Количество() > 1 Тогда
		Если МассивПересчетаСрКурсов[0].Дата = МассивПересчетаСрКурсов[1].Дата 
			И МассивПересчетаСрКурсов[0].Валюта = МассивПересчетаСрКурсов[1].Валюта 
			И МассивПересчетаСрКурсов[0].ПокупкаПродажа = МассивПересчетаСрКурсов[1].ПокупкаПродажа Тогда
			МассивПересчетаСрКурсов.Удалить(1);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МассивПересчетаСрКурсов", МассивПересчетаСрКурсов);	
	
	// Средний курс Окончание
	
	ПересчитатьИтоги(); 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  
	
	// Средний курс Начало
	
	Если ДополнительныеСвойства.Свойство("МассивПересчетаСрКурсов") Тогда
		
		// Здесь вызываем процедуру расчета и записи в независимый Регистр Сведений.
		// База данных в этот момент находится в идеальном (уже обновленном) состоянии.
		Для каждого Эл Из ДополнительныеСвойства.МассивПересчетаСрКурсов Цикл
			РассчитатьИЗаписатьСреднийКурс(Эл.Дата, Эл.Валюта, Эл.ПокупкаПродажа); 
		КонецЦикла;
		
	КонецЕсли; 
	
	// Средний курс Окончание

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	Привязки.Очистить();
	СуммаПривязано = 0;
	
	Валюта = Фирма.Валюта;
	ДСчет = ПараметрыСеанса.ДСчет;  
	Инвойсы.Очистить();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)   

	// © Primus1C  11.03.2024  НАЧАЛО ►
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДвижениеДенег") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер,Дата");
		Сумма 			= - Сумма;
	Иначе
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	Фирма 				= гоФирма();
	Привязки.Очистить();
	СуммаПривязано 		= 0;
	
	Валюта 				= Фирма.Валюта;
	ДСчет 				= ПараметрыСеанса.ДСчет;
	
	ПриходРасход 		= Перечисления.ПриходРасход.Приход;
	ВидДвиженияДенег 	= Перечисления.ВидДвиженияДенег.Покупатели;   
	
	// © Primus1C  11.03.2024  НАЧАЛО ►
	КонецЕсли;     
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	КемСоздан 		= гоПользователь(); 
	Создан 			= ТекущаяДатаСеанса(); 
	Окончательно 	= Ложь;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЕстьДеньги 			= Ложь;
	ЕстьДолги 			= Ложь;
	ЕстьНезакрытые 		= Ложь;
	ЕстьРасходыДоходы 	= Ложь;
	ЕстьПодотчет 		= Истина;
	ЕстьЗарплата 		= Истина;
	
	Если Окончательно Тогда
		Если ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Покупатели Тогда  
			Для Каждого Стр Из Привязки Цикл
				Если Стр.ЭтоПредоплата Тогда
					Движение = Движения.Долги.ДобавитьПриход();
				Иначе
					Движение = Движения.Долги.ДобавитьРасход();
				КонецЕсли; 
				
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Док = Стр.Док2;
				Движение.Валюта = Стр.Валюта2;
				Движение.Контрагент = Контрагент;
				Движение.ДолгПокупателя = ?(Стр.ЭтоПредоплата, 0, Стр.Сумма2);
				Движение.ПредоплатаПокупателя = ?(Стр.ЭтоПредоплата, Стр.Сумма2, 0);
				Движение.ДолгПоставщику = 0;
				Движение.ПредоплатаПоставщику = 0;
				Движение.Чем = Ссылка;
				ЕстьДолги = Истина;
			КонецЦикла; 
			
			Предоплата = Сумма - СуммаПривязано;
			Если Предоплата <> 0 Тогда
				Движение = Движения.Долги.ДобавитьПриход();
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Док = Ссылка;
				Движение.Валюта = Валюта;
				Движение.Контрагент = Контрагент;
				Движение.ДолгПокупателя = 0;
				Движение.ПредоплатаПокупателя = Предоплата;
				Движение.ДолгПоставщику = 0;
				Движение.ПредоплатаПоставщику = 0;
				Движение.Чем = 0;
				ЕстьДолги = Истина;
			КонецЕсли;
			
			Движение = Движения.Деньги.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
		//2015.11.22	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Поставщики Тогда  
		
			// © Primus1C  30.06.2023  НАЧАЛО ►
			Движения._ВзаиморасчетыСПоставщиками.Записывать = Истина; 
			Если Привязки.Количество() = 0 Тогда
				Движение			 = Движения._ВзаиморасчетыСПоставщиками.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период		 = Дата;
				Движение.Контрагент	 = Контрагент;
				//Движение.Инвойс		 = ; 
				Движение.СуммаОплаты = Сумма;
				Движение.Валюта		 = Валюта;  
			Иначе
				Для Каждого Стр Из Привязки Цикл   
					Если ТипЗнч(Стр.Док2) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
						лИнвойс = Стр.Док2.ВКД_Инвойс;
					Иначе	
					    лИнвойс = Неопределено;
					КонецЕсли;
					Движение			 = Движения._ВзаиморасчетыСПоставщиками.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период		 = Дата;
					Движение.Контрагент	 = Контрагент;
					Движение.Инвойс		 = лИнвойс; 
					Движение.СуммаОплаты = Стр.Сумма2;
					Движение.Валюта		 = Стр.Валюта2;
				КонецЦикла;
			КонецЕсли;   
			// РН РасчетыПоИнвойсам
			Движения.РасчетыПоИнвойсам.Записывать = Истина; 
			Если Контрагент.ПривязыватьИнвойсы Тогда  
				Для каждого СтрокаТЧ Из Инвойсы Цикл
					Движение			 = Движения.РасчетыПоИнвойсам.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период		 = Дата;
					Движение.Контрагент	 = Контрагент;
					Движение.Инвойс		 = СтрокаТЧ.Инвойс; 
					Движение.Валюта		 = Валюта; 
					Движение.Сумма		 = СтрокаТЧ.Сумма;
				КонецЦикла;
			КонецЕсли;
			// © Primus1C  ОКОНЧАНИЕ ◄
			
			Для Каждого Стр Из Привязки Цикл
				Если Стр.ЭтоПредоплата Тогда
					Движение = Движения.Долги.ДобавитьПриход();
				Иначе
					Движение = Движения.Долги.ДобавитьРасход();
				КонецЕсли; 
				
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Док = Стр.Док2;
				Движение.Валюта = Стр.Валюта2;
				Движение.Контрагент = Контрагент;
				Движение.ДолгПокупателя = 0;
				Движение.ПредоплатаПокупателя = 0;
				Движение.ДолгПоставщику = ?(Стр.ЭтоПредоплата, 0, Стр.Сумма2);
				Движение.ПредоплатаПоставщику = ?(Стр.ЭтоПредоплата, Стр.Сумма2, 0);
				Движение.Чем = Ссылка;
				ЕстьДолги = Истина;
			КонецЦикла; 
			
			Предоплата = Сумма - СуммаПривязано;
			Если Предоплата <> 0 Тогда
				Движение = Движения.Долги.ДобавитьПриход();
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Док = Ссылка;
				Движение.Валюта = Валюта;
				Движение.Контрагент = Контрагент;
				Движение.ДолгПокупателя = 0;
				Движение.ПредоплатаПокупателя = 0;
				Движение.ДолгПоставщику = 0;
				Движение.ПредоплатаПоставщику = Предоплата;
				Движение.Чем = 0;
				ЕстьДолги = Истина;
			КонецЕсли;
			
			Движение = Движения.Деньги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
		//2015.11.22	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Перемещение Тогда
			Движение = Движения.Деньги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
			
			Движение = Движения.Деньги.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = СубДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
		//2015.11.22	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.ОбменВалюты Тогда
			Движение = Движения.Деньги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
			
			Движение = Движения.Деньги.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = СубДСчет;
			Движение.Валюта = СубДВалюта;
			Движение.Остаток = СубДСумма;
			ЕстьДеньги = Истина;
		//2015.11.22	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Расходы Тогда
			Движение = Движения.Деньги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
			
			Движение = Движения.РасходыДоходы.Добавить();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Вид = Перечисления.ДоходРасход.Расход;
			Движение.Статья = Статья;
			Движение.Валюта = Валюта;
			Движение.Сумма = Сумма;
			ЕстьРасходыДоходы = Истина;
		//2015.11.22	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Доходы Тогда
			Движение = Движения.Деньги.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
			
			Движение = Движения.РасходыДоходы.Добавить();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Вид = Перечисления.ДоходРасход.Доход;
			Движение.Статья = Статья;
			Движение.Валюта = Валюта;
			Движение.Сумма = Сумма;
			ЕстьРасходыДоходы = Истина;
		//2015.11.22	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Подотчет Тогда
			Движение = Движения.Деньги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
			
			Движение = Движения.Подотчет.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Подлицо = Сотрудник;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьПодотчет = Истина;
		//2015.11.22	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Зарплата Тогда
			Движение = Движения.Деньги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;
			
			Движение = Движения.Зарплата.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Сотрудник = Сотрудник;
			Движение.МесяцЗП = НачалоМесяца(МесяцЗП);
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьПодотчет = Истина;
		//2016.01.31	
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.ВводОстатков Тогда
			Движение = Движения.Деньги.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;   
		// © Primus1C  01.11.2024  НАЧАЛО ►
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Инвестиции Тогда
			Если Сумма > 0 Тогда
				Движение = Движения.Инвестиции.ДобавитьПриход(); 
				ДвижениеД = Движения.Деньги.ДобавитьПриход();
				лСумма = Сумма;
			Иначе
				Движение = Движения.Инвестиции.ДобавитьРасход();
				ДвижениеД = Движения.Деньги.ДобавитьРасход();
				лСумма = - Сумма;
			КонецЕсли;
			Движение.Период 	= Дата;
			Движение.Контрагент = Контрагент;
			Движение.Валюта 	= Валюта;
			Движение.Сумма 		= лСумма; 
			Движения.Инвестиции.Записывать = Истина;   
			
			ДвижениеД.Период 	= Дата;
			ДвижениеД.Фирма 	= Фирма;
			ДвижениеД.Касса 	= ДСчет;
			ДвижениеД.Валюта 	= Валюта;
			ДвижениеД.Остаток 	= лСумма;
			ЕстьДеньги = Истина;
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Биржа Тогда
			Если Сумма > 0 Тогда
				Движение = Движения.Биржа.ДобавитьПриход(); 
				ДвижениеД = Движения.Деньги.ДобавитьПриход();
				лСумма = Сумма;
			Иначе
				Движение = Движения.Биржа.ДобавитьРасход();
				ДвижениеД = Движения.Деньги.ДобавитьРасход();
				лСумма = - Сумма;
			КонецЕсли;
			Движение.Период 	= Дата;
			Движение.Статья 	= Статья;
			Движение.Валюта 	= Валюта;
			Движение.Сумма 		= лСумма; 
			Движения.Биржа.Записывать = Истина;   
			
			ДвижениеД.Период 	= Дата;
			ДвижениеД.Фирма 	= Фирма;
			ДвижениеД.Касса 	= ДСчет;
			ДвижениеД.Валюта 	= Валюта;
			ДвижениеД.Остаток 	= лСумма;
			ЕстьДеньги = Истина;   
		ИначеЕсли ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Логистика Тогда  
			Движение = Движения.Деньги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Касса = ДСчет;
			Движение.Валюта = Валюта;
			Движение.Остаток = Сумма;
			ЕстьДеньги = Истина;   
		// © Primus1C  ОКОНЧАНИЕ ◄	
		КонецЕсли;
		
		//2015.11.26
		//универсально, независимо от типа, проводим КР, если они есть
		Если СуммаКР <> 0 Тогда
			Движение = Движения.РасходыДоходы.Добавить();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Статья = ?(СуммаКР < 0, Справочники.Статьи.РасходОтКР, Справочники.Статьи.ДоходОтКР);
			//здесь вид после
			Движение.Вид = Движение.Статья.ВидСтатьи;
			Движение.Валюта = Валюта;
			Движение.Сумма = гоАбс(СуммаКР);
			ЕстьРасходыДоходы = Истина;
		КонецЕсли; 
	Иначе
		Движение = Движения.НезакрытыеДокументы.ДобавитьПриход();
		Движение.Период 		= Дата;
		Движение.Фирма 			= Фирма;
		Движение.Контрагент 	= Контрагент;
		Движение.ВидДокумента 	= Перечисления.ВидДокумента.ДвижениеДенег;
		Движение.Количество 	= 1;
		ЕстьНезакрытые 			= Истина И ВидДвиженияДенег <> Перечисления.ВидДвиженияДенег.Инвестиции;
	КонецЕсли; 
	
	Движения.Долги.Записывать 				= ЕстьДолги;
	Движения.Деньги.Записывать 				= ЕстьДеньги;
	Движения.НезакрытыеДокументы.Записывать = ЕстьНезакрытые ;
	Движения.РасходыДоходы.Записывать 		= ЕстьРасходыДоходы;
	Движения.Подотчет.Записывать 			= ЕстьПодотчет;
	Движения.Зарплата.Записывать 			= ЕстьЗарплата;   
	
	// © Primus1C  10.11.2024  НАЧАЛО ► 
	// РН партии валют
    Движения.ПартииВалюты.Записывать = Истина;
	Если ДСчет.ВестиПартионныйУчет Тогда   
		
		Если ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.ОбменВалюты И СубДВалюта.ВестиПартионныйУчет Тогда
			// приход только при покупке валюты (обмен)
			Движение = Движения.ПартииВалюты.ДобавитьПриход(); 
			Движение.Период					= Дата;
			Движение.Касса 					= ДСчет;
			Движение.Валюта 				= СубДВалюта;
			Движение.Сумма					= СубДСумма;
			Движение.СуммаВБазовойВалюте	= Сумма; 
			
		ИначеЕсли ПриходРасход = Перечисления.ПриходРасход.Расход И СубДВалюта.ВестиПартионныйУчет Тогда
			Запр = Новый Запрос;
			Запр.УстановитьПараметр("Дата", 	МоментВремени());
			Запр.УстановитьПараметр("Валюта", 	Валюта);
			Запр.УстановитьПараметр("Касса", 	ДСчет);
			Запр.Текст = "ВЫБРАТЬ
			             |	ПартииВалютыОстатки.СуммаОстаток КАК Сумма,
			             |	ПартииВалютыОстатки.СуммаВБазовойВалютеОстаток КАК СуммаВБазовойВалюте
			             |ИЗ
			             |	РегистрНакопления.ПартииВалюты.Остатки(
			             |			&Дата,
			             |			Валюта = &Валюта
			             |				И Касса = &Касса) КАК ПартииВалютыОстатки";
			Выборка = Запр.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				Если Выборка.Сумма <> 0 Тогда
					к = Сумма / Выборка.Сумма;
					Движение = Движения.ПартииВалюты.ДобавитьРасход(); 
					Движение.Период					= Дата;
					Движение.Касса 					= ДСчет;
					Движение.Валюта 				= СубДВалюта;
					Движение.Сумма					= Сумма;
					Движение.СуммаВБазовойВалюте	= Выборка.СуммаВБазовойВалюте * к; 
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ПриходРасход = Перечисления.ПриходРасход.Расход И Валюта.ВестиПартионныйУчет Тогда
			Запр = Новый Запрос;
			Запр.УстановитьПараметр("Дата", 	МоментВремени());
			Запр.УстановитьПараметр("Валюта", 	Валюта);
			Запр.УстановитьПараметр("Касса", 	ДСчет);
			Запр.Текст = "ВЫБРАТЬ
			             |	ПартииВалютыОстатки.СуммаОстаток КАК Сумма,
			             |	ПартииВалютыОстатки.СуммаВБазовойВалютеОстаток КАК СуммаВБазовойВалюте
			             |ИЗ
			             |	РегистрНакопления.ПартииВалюты.Остатки(
			             |			&Дата,
			             |			Валюта = &Валюта
			             |				И Касса = &Касса) КАК ПартииВалютыОстатки";
			Выборка = Запр.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				Если Выборка.Сумма <> 0 Тогда
					к = Сумма / Выборка.Сумма;
					Движение = Движения.ПартииВалюты.ДобавитьРасход(); 
					Движение.Период					= Дата;
					Движение.Касса 					= ДСчет;
					Движение.Валюта 				= Валюта;
					Движение.Сумма					= Сумма;
					Движение.СуммаВБазовойВалюте	= Выборка.СуммаВБазовойВалюте * к; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//Если ПриходРасход = Перечисления.ПриходРасход.Пход Тогда
		//	Движение = Движения.ПартииВалюты.ДобавитьПриход(); 
		//	Движение.Период					= Дата;
		//	Движение.Касса 					= ДСчет;
		//	Движение.Валюта 				= СубДВалюта;
		//	Движение.Сумма					= Сумма;
		//	Движение.СуммаВБазовойВалюте	= СубДСумма;
		//Иначе		
		//	Запр = Новый Запрос;
		//	Запр.Текст = "ВЫБРАТЬ
		//	             |	ПартииВалютыОстатки.СуммаОстаток КАК Сумма,
		//	             |	ПартииВалютыОстатки.СуммаВБазовойВалютеОстаток КАК СуммаВБазовойВалюте
		//	             |ИЗ
		//	             |	РегистрНакопления.ПартииВалюты.Остатки(
		//	             |			&Дата,
		//	             |			Валюта = &Валюта
		//	             |				И Касса = &Касса) КАК ПартииВалютыОстатки
		//	             |ИТОГИ
		//	             |	СУММА(Сумма),
		//	             |	СУММА(СуммаВБазовойВалютеОстаток)
		//	             |ПО
		//	             |	ОБЩИЕ";
		//	Запр.УстановитьПараметр("Дата", МоментВремени());
		//	Запр.УстановитьПараметр("Валюта", Валюта);
		//	Запр.УстановитьПараметр("Касса", ДСчет);  
		//	Выборка = Запр.Выполнить().Выбрать();
		//	Если Выборка.Следующий() Тогда
		//		Движение = Движения.ПартииВалюты.ДобавитьРасход(); 
		//		Движение.Период	= Дата;
		//		Движение.Касса 	= ДСчет;
		//		Движение.Валюта = Валюта;
		//		
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;    
	
	// статусы инвойсов	
	Если ДополнительныеСвойства.Свойство("ИнвойсыДляЗаписиСтатусов") Тогда
		МассивИнвойсов = ДополнительныеСвойства.ИнвойсыДляЗаписиСтатусов;
		Если МассивИнвойсов <> Неопределено И МассивИнвойсов.Количество() > 0 Тогда
			РассчитатьИЗаписатьСтатусыИнвойсов(МассивИнвойсов);
		КонецЕсли;
	КонецЕсли;
	
    // Последовательность
	лВалюта = Неопределено;
	лКасса = Неопределено;
	Если Валюта.ВестиПартионныйУчет Тогда
		лВалюта = Валюта;
	КонецЕсли;
	Если СубДВалюта.ВестиПартионныйУчет Тогда
		лВалюта = СубДВалюта;
	КонецЕсли;
	Если ДСчет.ВестиПартионныйУчет Тогда
		лКасса = ДСчет;
	КонецЕсли;
	Если СубДСчет.ВестиПартионныйУчет Тогда
		лКасса = СубДСчет;
	КонецЕсли;
	
	НаборПоследовательности = Последовательности.ПартииВалют.СоздатьНаборЗаписей();
	НаборПоследовательности.Отбор.Регистратор.Установить(Ссылка); 
	
	Если ЗначениеЗаполнено(лВалюта) И ЗначениеЗаполнено(лКасса) Тогда
		Запись = НаборПоследовательности.Добавить();
		Запись.Регистратор = Ссылка; // Для последовательности это поле обязательно
		Запись.Период      = Дата;   // Для последовательности это поле обязательно
		// Заполняем измерения
		Запись.Касса  = лКасса;
		Запись.Валюта = лВалюта;
	КонецЕсли;
	
	// Метод Записать() внутри транзакции проведения отработает идеально:
	// - Если условие выше выполнилось, он перезапишет старую регистрацию на новую.
	// - Если условие НЕ выполнилось (набор остался пустым), метод сотрет старую запись 
	//   этого документа из последовательности, корректно сняв его с учета.
	НаборПоследовательности.Записать();

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Если гоАдминистратор() Тогда Возврат КонецЕсли; 
	
	Если Окончательно Тогда Сообщить("Отмена проведения невозможна! Документ закрыт {Окончательно}!"); Отказ = Истина; КонецЕсли;
	
	Если Привязки.Количество() <> 0 Тогда Сообщить("Отмена проведения невозможна! Документ не пустой!"); Отказ = Истина; КонецЕсли;
	
	// статусы инвойсов	
	Если ДополнительныеСвойства.Свойство("ИнвойсыДляЗаписиСтатусов") Тогда
		МассивИнвойсов = ДополнительныеСвойства.ИнвойсыДляЗаписиСтатусов;
		Если МассивИнвойсов <> Неопределено И МассивИнвойсов.Количество() > 0 Тогда
			РассчитатьИЗаписатьСтатусыИнвойсов(МассивИнвойсов);
		КонецЕсли;
	КонецЕсли;   

КонецПроцедуры

Процедура РассчитатьИЗаписатьСтатусыИнвойсов(МассивИнвойсов)
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Инвойсы", МассивИнвойсов);
	Запр.УстановитьПараметр("Ссылка", Ссылка);   
	Запр.Текст = "ВЫБРАТЬ
	             |	ЕСТЬNULL(Долги.СуммаОстаток, 0) КАК ДолгПоРегистру,
	             |	ЕСТЬNULL(ТЧ.Сумма, 0) КАК СуммаОплатыТЧ,
	             |	АктуальныеИнвойсы.Ссылка.ДокументОснование.Сумма КАК СуммаИнвойса,
	             |	АктуальныеИнвойсы.Ссылка КАК Инвойс
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		_Инвойс.Ссылка КАК Ссылка
	             |	ИЗ
	             |		Документ._Инвойс КАК _Инвойс
	             |	ГДЕ
	             |		_Инвойс.Ссылка В(&Инвойсы)) КАК АктуальныеИнвойсы,
	             |	(ВЫБРАТЬ
	             |		ДвижениеДенегИнвойсы.Инвойс КАК Инвойс,
	             |		ДвижениеДенегИнвойсы.Сумма КАК Сумма
	             |	ИЗ
	             |		Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	             |	ГДЕ
	             |		ДвижениеДенегИнвойсы.Ссылка = &Ссылка) КАК ТЧ,
	             |	(ВЫБРАТЬ
	             |		РасчетыПоИнвойсамОстатки.Инвойс КАК Инвойс,
	             |		СУММА(РасчетыПоИнвойсамОстатки.СуммаОстаток) КАК СуммаОстаток
	             |	ИЗ
	             |		РегистрНакопления.РасчетыПоИнвойсам.Остатки(, Инвойс В (&Инвойсы)) КАК РасчетыПоИнвойсамОстатки
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		РасчетыПоИнвойсамОстатки.Инвойс) КАК Долги";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДолгПоРегистру - Выборка.СуммаОплатыТЧ = 0 Тогда
		 	СтатусОплатыАвто = Перечисления.Долги.Полностью;
		ИначеЕсли Выборка.ДолгПоРегистру - Выборка.СуммаОплатыТЧ = Выборка.СуммаИнвойса Тогда
		 	СтатусОплатыАвто = Перечисления.Долги.Неоплачено;
		Иначе
		 	СтатусОплатыАвто = Перечисления.Долги.Частично;
		КонецЕсли;
		ОбщегоНазначенияСервер.ЗаписатьСтатусыИнвойса(Выборка.Инвойс, , , , СтатусОплатыАвто, Выборка.Инвойс);
	КонецЦикла;

КонецПроцедуры

Процедура РассчитатьИЗаписатьСреднийКурс(ДатаЗаписи, Знач ВалютаЗаписи, ПокупкаПродажа)
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", 	Ссылка);
	Запр.УстановитьПараметр("Фирма", 	Фирма);
	Запр.УстановитьПараметр("Валюта", 	ВалютаЗаписи);
	//Запр.УстановитьПараметр("СубДВалюта", ПараметрыСеанса.БазоваяВалюта);
	Запр.УстановитьПараметр("ДатаНач", 	ДатаЗаписи);
	Запр.УстановитьПараметр("ДатаКон", 	КонецДня(ДатаЗаписи));
	Запр.УстановитьПараметр("ЭтоПокупка", ПокупкаПродажа = "Покупка");
	Запр.Текст = "ВЫБРАТЬ
	             |	ЕСТЬNULL(СУММА(Свод.СубДСумма), 0) КАК СубДСумма,
	             |	ЕСТЬNULL(СУММА(Свод.Сумма), 0) КАК Сумма
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ДвижениеДенег.СубДСумма КАК СубДСумма,
	             |		ДвижениеДенег.Сумма КАК Сумма
	             |	ИЗ
	             |		Документ.ДвижениеДенег КАК ДвижениеДенег
	             |	ГДЕ
	             |		ДвижениеДенег.ВидДвиженияДенег = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДенег.ОбменВалюты)
	             |		И ДвижениеДенег.РассчитыватьСреднийКурс
	             |		И ДвижениеДенег.Проведен
	             |		И ДвижениеДенег.Дата МЕЖДУ &ДатаНач И &ДатаКон
	             |		И ДвижениеДенег.Фирма = &Фирма
	             |		И ДвижениеДенег.Ссылка <> &Ссылка
	             |		И ВЫБОР
	             |				КОГДА &ЭтоПокупка
	             |					ТОГДА ДвижениеДенег.СубДВалюта = &Валюта
	             |				ИНАЧЕ ДвижениеДенег.Валюта = &Валюта
	             |			КОНЕЦ
	             |	
	             |	ОБЪЕДИНИТЬ
	             |	
	             |	ВЫБРАТЬ
	             |		ДвижениеДенег.СубДСумма,
	             |		ДвижениеДенег.Сумма
	             |	ИЗ
	             |		Документ.ДвижениеДенег КАК ДвижениеДенег
	             |	ГДЕ
	             |		ДвижениеДенег.Ссылка = &Ссылка
	             |		И ДвижениеДенег.Проведен
	             |		И ДвижениеДенег.РассчитыватьСреднийКурс) КАК Свод";
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		//Если ВалютаЗаписи.ОбратныйКурс ИЛИ ПокупкаПродажа = "Покупка" Тогда
		Если ПокупкаПродажа = "Покупка" Тогда
			СумДелимое = Выборка.Сумма;
			СумДелитель = Выборка.СубДСумма; 
		Иначе	
			СумДелимое = Выборка.СубДСумма;
			СумДелитель = Выборка.Сумма;
		КонецЕсли;  
		Если ВалютаЗаписи.ОбратныйКурс Тогда
			тмп = СумДелимое;
			СумДелимое = СумДелитель;	
		    СумДелитель = тмп;
		КонецЕсли;
		Если СумДелитель = 0 Тогда
			Возврат;
		КонецЕсли;
		СреднийКурс = СумДелимое / СумДелитель;
		
		Если ВалютаЗаписи = ПараметрыСеанса.Валюта Тогда    
			// курс рубля пишем в доллар
			ВалютаЗаписи = ПараметрыСеанса.БазоваяВалюта;
		КонецЕсли;
		
		// Приводим дату к началу дня, так как периодичность регистра - День
		ПериодДень = НачалоДня(Дата);
		
		// Создаем менеджер для работы с конкретной записью
		МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		
		// Устанавливаем ключевые поля (Период + Измерения) для поиска нужной записи
		МенеджерЗаписи.Период = ПериодДень;
		МенеджерЗаписи.Фирма  = Фирма;
		МенеджерЗаписи.Валюта = ВалютаЗаписи;
		
		// Читаем текущую запись из базы данных.
		// Метод Прочитать() возвращает Истина, если запись найдена.
		// Если запись найдена, ее ресурсы загрузятся в МенеджерЗаписи (мы их не потеряем).
		МенеджерЗаписи.Прочитать();
		
		// Заполняем ключевые поля (они могли очиститься, если Прочитать() вернул Ложь)
		МенеджерЗаписи.Период = ПериодДень;
		МенеджерЗаписи.Фирма  = Фирма;
		МенеджерЗаписи.Валюта = ВалютаЗаписи;
		
		// Устанавливаем новое значение ресурса 
		Если ПокупкаПродажа = "Покупка" Тогда
			МенеджерЗаписи.КурсЗакупкиСредний = СреднийКурс;
		Иначе
			МенеджерЗаписи.КурсПродажиСредний = СреднийКурс;
		КонецЕсли;
		
		// Записываем изменения в базу данных
		МенеджерЗаписи.Записать();	
		
	КонецЕсли;

КонецПроцедуры
